Revit 2026 API

# LabelUtilsGetLabelFor(PipeLossMethodType, Document) Method

---

Gets the user-visible name for a PipeLossMethodType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelFor(
	PipeLossMethodType pipeLossMethodType,
	Document doc
)
```
```vb
Public Shared Function GetLabelFor (
	pipeLossMethodType As PipeLossMethodType,
	doc As Document
) As String
```
```cpp
public:
static String^ GetLabelFor(
	PipeLossMethodType pipeLossMethodType,
	Document^ doc
)
```
```fsharp
static member GetLabelFor :
        pipeLossMethodType : PipeLossMethodType *
        doc : Document -> string
```

#### Parameters

pipeLossMethodType PipeLossMethodType
     The PipeLossMethodType to get the user-visible name.
doc Document
     The document from which to get the PipeLossMethodType.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when information for the input PipeLossMethodType cannot be found. |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace